module NumberHumanizer::Languages
  class Arabic < Base
    UNITS_DICTIONARY = {
      1 => '',
      2 => 'ألف',
      3 => 'مليون',
      4 => 'مليار',
      5 => 'بليون',
      6 => 'بليار',
      7 => 'تريليون',
      8 => 'تريليار',
      9 => 'كريليون',
      10 => 'كريليار',
      11 => 'سنكليون',
      12 => 'سنكليار',
      13 => 'سيزيليون',
      14 => 'سيزيليار',
      15 => 'سيتليون',
      16 => 'سيتليار',
      17 => 'ويتليون',
      18 => 'ويتليار',
      19 => 'تيفليون',
      20 => 'تيفليار',
      21 => 'ديشليون',
      22 => 'ديشلي'
    }.freeze

    NUMBERS_DICTIONARY = {
      0   => 'صفر',
      1   => 'واحد',
      2   => 'إثنان',
      3   => 'ثلاثة',
      4   => 'أربعة',
      5   => 'خمسة',
      6   => 'ستة',
      7   => 'سبعة',
      8   => 'ثمانية',
      9   => 'تسعة',
      10  => 'عشرة',
      11  => 'احد عشر',
      12  => 'اثنا عشر',
      13  => 'ثلاثة عشر',
      14  => 'أربعة عشر',
      15  => 'خمسة عشر',
      16  => 'ستة عشر',
      17  => 'سبعة عشر',
      18  => 'ثمانية عشر',
      19  => 'تسعة عشر',
      20  => 'عشرون',
      30  => 'ثلاثون',
      40  => 'أربعون',
      50  => 'خمسون',
      60  => 'ستون',
      70  => 'سبعون',
      80  => 'ثمانون',
      90  => 'تسعون',
      100 => 'مائة',
      200 => 'مئتان',
      2000 => 'ألفان'
    }.freeze

    AND_CONNECTOR = " و ".freeze
    DECIMAL_POINT_CONNECTOR = " فاصل ".freeze
    MINUS_WORD = "سالب ".freeze
  end
end
